app/views/films/show.html.erb

        <div class="star-rating" data-score= <%= @avg_review %> ></div>
          <em><%= "#{@film.comments.length} ratings" %></em>
---
SELECT "comments".* FROM "comments" WHERE "comments"."film_id" = ?  [["film_id", 11]]
SELECT AVG("comments"."rating") FROM "comments" WHERE "comments"."film_id" = ?  [["film_id", 12]]