app/controllers/comments_controller.rb

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "film_id", "created_at", "updated_at", "user_id", "rating") VALUES (?, ?, ?, ?, ?, ?)  [["body", "sdds"], ["film_id", 12], ["created_at", 2017-05-14 09:23:13 UTC], ["updated_at", 2017-05-14 09:23:13 UTC], ["user_id", 1], ["rating", 5]]
---
  def create
    @film = Film.find(params[:film_id])
    @comment = @film.comments.create(comment_params)

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."film_id" = ? AND "comments"."id" = ? LIMIT ?  [["film_id", 11], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
def destroy
  @film = Film.find(params[:film_id])
  @comment = @film.comments.find(params[:id])
  @comment.destroy