app/controllers/films_controller.rb

def search
  if params[:search].present?
    @films = Film.search(params[:search])
---
SELECT "films".* FROM "films"

  def index
   @films = Film.all.order('created_at DESC').page(params[:page]).per_page(6)
---
SELECT  "films".* FROM "films" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "films"

  def show
   @film = Film.find(params[:id])

   if @film.comments.blank?
    @avg_review = 0
  else
    @avg_review = @film.comments.average(:rating).round(2)
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."film_id" = ?  [["film_id", 11]]
SELECT AVG("comments"."rating") FROM "comments" WHERE "comments"."film_id" = ?  [["film_id", 12]]

  def edit
    @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @film = Film.find(params[:id])
    @film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 2]]

  def create
    @film = current_user.films.build(film_params)

    if @film.save
---
INSERT INTO "films" ("title", "director", "year", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdvsdf"], ["director", "bkjgk"], ["year", "bkjuhku"], ["created_at", 2017-05-15 13:58:39 UTC], ["updated_at", 2017-05-15 13:58:39 UTC], ["user_id", 2]]

  def update
  @film = Film.find(params[:id])

  if @film.update(film_params)
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "films" SET "poster_file_name" = ?, "poster_content_type" = ?, "poster_file_size" = ?, "poster_updated_at" = ?, "updated_at" = ? WHERE "films"."id" = ?